In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichok', np.nan, 'avocado'])

In [3]:
string_data

0    aardvark
1    artichok
2         NaN
3     avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data

In [7]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [13]:
data.dropna() # it will drops the NA values with their indexes temporarily.

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned = data.dropna()

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [21]:
data.dropna(how='all') # how='all' will drop NA which will cover the entire row.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data[4] = NA

In [24]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [27]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
df = pd.DataFrame(np.random.randn(7, 3))

In [29]:
df

          0         1         2
0  0.396025  0.299117 -0.668595
1  0.115826  0.549899 -1.744384
2  0.190334 -0.984525 -0.792864
3  0.804029  0.548363 -0.476639
4  0.661487  0.169725 -0.050107
5  0.251892  0.704602  1.815787
6 -0.665960  0.154858 -0.160081

In [32]:
df.iloc[:4, 1] = NA # till row number 4 in column number 1 set the NA value.

In [33]:
df

          0         1         2
0  0.396025       NaN -0.668595
1  0.115826       NaN -1.744384
2  0.190334       NaN -0.792864
3  0.804029       NaN -0.476639
4  0.661487  0.169725 -0.050107
5  0.251892  0.704602  1.815787
6 -0.665960  0.154858 -0.160081

In [34]:
df.iloc[:2, 2] = NA

In [35]:
df

          0         1         2
0  0.396025       NaN       NaN
1  0.115826       NaN       NaN
2  0.190334       NaN -0.792864
3  0.804029       NaN -0.476639
4  0.661487  0.169725 -0.050107
5  0.251892  0.704602  1.815787
6 -0.665960  0.154858 -0.160081

In [36]:
df.dropna()

          0         1         2
4  0.661487  0.169725 -0.050107
5  0.251892  0.704602  1.815787
6 -0.665960  0.154858 -0.160081

In [40]:
df.dropna(thresh=2) # jya minimum none NA values 2 hoy teva data rehva do. AS SIMPLE AS THAT.

          0         1         2
2  0.190334       NaN -0.792864
3  0.804029       NaN -0.476639
4  0.661487  0.169725 -0.050107
5  0.251892  0.704602  1.815787
6 -0.665960  0.154858 -0.160081

## Filling in Missing Data

In [41]:
df

          0         1         2
0  0.396025       NaN       NaN
1  0.115826       NaN       NaN
2  0.190334       NaN -0.792864
3  0.804029       NaN -0.476639
4  0.661487  0.169725 -0.050107
5  0.251892  0.704602  1.815787
6 -0.665960  0.154858 -0.160081

In [43]:
df.fillna(0) # it will set 0 inplace of NaN values.

          0         1         2
0  0.396025  0.000000  0.000000
1  0.115826  0.000000  0.000000
2  0.190334  0.000000 -0.792864
3  0.804029  0.000000 -0.476639
4  0.661487  0.169725 -0.050107
5  0.251892  0.704602  1.815787
6 -0.665960  0.154858 -0.160081

In [44]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.396025  0.500000  0.000000
1  0.115826  0.500000  0.000000
2  0.190334  0.500000 -0.792864
3  0.804029  0.500000 -0.476639
4  0.661487  0.169725 -0.050107
5  0.251892  0.704602  1.815787
6 -0.665960  0.154858 -0.160081

In [53]:
_  = df.fillna(0, inplace=True)

In [54]:
df

          0         1         2
0  0.396025  0.000000  0.000000
1  0.115826  0.000000  0.000000
2  0.190334  0.000000 -0.792864
3  0.804029  0.000000 -0.476639
4  0.661487  0.169725 -0.050107
5  0.251892  0.704602  1.815787
6 -0.665960  0.154858 -0.160081

In [55]:
df = pd.DataFrame(np.random.randn(6, 3))

In [56]:
df

          0         1         2
0  0.967005 -1.664605  0.274863
1 -0.545047  1.037370  1.500679
2  0.532694 -0.774773 -0.613560
3  0.586227 -0.212955 -0.289407
4 -0.914187 -0.218137  0.107224
5  0.286305  1.607242 -0.418931

In [57]:
df.iloc[2:, 1] = NA

In [58]:
df.iloc[4:, 2] = NA

In [59]:
df

          0         1         2
0  0.967005 -1.664605  0.274863
1 -0.545047  1.037370  1.500679
2  0.532694       NaN -0.613560
3  0.586227       NaN -0.289407
4 -0.914187       NaN       NaN
5  0.286305       NaN       NaN

In [60]:
df.fillna(method='ffill')

          0         1         2
0  0.967005 -1.664605  0.274863
1 -0.545047  1.037370  1.500679
2  0.532694  1.037370 -0.613560
3  0.586227  1.037370 -0.289407
4 -0.914187  1.037370 -0.289407
5  0.286305  1.037370 -0.289407

In [62]:
df.fillna(method='ffill', limit=2) # 2 j vaar copy karo pachhi NaN as it is reva do.

          0         1         2
0  0.967005 -1.664605  0.274863
1 -0.545047  1.037370  1.500679
2  0.532694  1.037370 -0.613560
3  0.586227  1.037370 -0.289407
4 -0.914187       NaN -0.289407
5  0.286305       NaN -0.289407

In [63]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [64]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [65]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64